sample/load-test.yml
# @doc https://artillery.io/docs/script-reference/
config:
  target: 127.0.0.1:8080
  phases:
    - duration: 10 #sec
      arrivalRate: 1
  engines:
    # artillery-engine-grpc's specific configuration
    grpc:
      # can set grpc-ChannelOptions
      # https://grpc.github.io/grpc/node/grpc.Channel.html
      # the available options are listed at:
      # https://grpc.github.io/grpc/core/group__grpc__arg__keys.html
      channelOpts:
        grpc.client_idle_timeout_ms: 1000
      # specify .proto file basic information
      protobufDefinition:
        filepath: protobuf-definitions/backend/services/v1/hello.proto
        package: backend.services.v1
        service: HelloService
      # can overrider @grpc/proto-loader's configuration
      # https://www.npmjs.com/package/@grpc/proto-loader
      protoLoaderConfig:
        keepCase: true
        longs: String
        enums: String
        bytes: Buffer
        defaults: false
        arrays: false
        objects: false
        oneofs: true
        includeDirs: [ './protobuf-definitions' ]
      metadata:
        "user-id": u123

scenarios:
  - name: test backend-service running at http://localhost:8000
    # specify engine's name here
    engine: grpc
    # list RPC names with its arguments
    flow:
      # You can log any prefereed string
      # - log: 'scenario started'
      - Hello:
          id: 1
          name: Alice
          platform: ANDROID # specifiy enum value with large capitals
      - Hello:
          id: 2
          name: Bob
          platform: 1 # ="IOS" you can pass enum value as well
      - Hello:
          id: 3
          name: Chris
          platform: WEB # specifiy enum value with large capitals
      - Bye:
          id: 4
      - Bye:
          id: 5