sample/load-test.yml
config:
  target: '127.0.0.1:8080'
  phases:
    - duration: 60
      arrivalRate: 20
  engines:
    grpc:
      protobufDefinition: 'protobuf-definitions/backend/services/v1/hello.proto'

scenarios:
  - name: "test backend-service running at http://localhost:8000"
    engine: "grpc"
    flow:
    - get:
        url: "/docs"