sample/load-test.yml
# @doc https://artillery.io/docs/script-reference/
config:
  target: 127.0.0.1:8080
  phases:
    - duration: 10 #sec
      arrivalRate: 10
  engines:
    grpc:
      protobufDefinition:
        filepath: protobuf-definitions/backend/services/v1/hello.proto
        package: backend.services.v1
        service: HelloService

scenarios:
  - name: test backend-service running at http://localhost:8000
    engine: grpc
    # list RPC names with its arguments
    flow:
      - log: 'scenario started'
      - Hello:
          id: 1
          name: Alice
      - Hello:
          id: 2
          name: Bob
      - Hello:
          id: 3
          name: Chris
      - Bye:
          id: 4
      - Bye:
          id: 5